# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\psoc4\Patrulator\Patrulator.cydsn\Patrulator.cyprj
# Date: Thu, 11 Jun 2015 08:59:10 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 666.66666666666663 -waveform {0 333.333333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_12KHz(FFB)} -period 83333.333333333328 -waveform {0 41666.6666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {Clock_12KHz} -source [get_pins {ClockBlock/hfclk}] -edges {1 251 501} -nominal_period 83333.333333333328 [list]


# Component constraints for C:\psoc4\Patrulator\Patrulator.cydsn\TopDesign\TopDesign.cysch
# Project: C:\psoc4\Patrulator\Patrulator.cydsn\Patrulator.cyprj
# Date: Thu, 11 Jun 2015 08:59:07 GMT
